controllers/admin/DashboardController.php

    public function actionIndex()
    {
        // ambil filter tanggal dari GET, default: 7 hari terakhir
        $tanggalAwal  = Yii::$app->request->get('tanggal_awal', date('Y-m-d', strtotime('-6 days')));
        $tanggalAkhir = Yii::$app->request->get('tanggal_akhir', date('Y-m-d'));

        // jaga-jaga kalau user menukar urutan tanggal
        if ($tanggalAwal > $tanggalAkhir) {
            [$tanggalAwal, $tanggalAkhir] = [$tanggalAkhir, $tanggalAwal];
        }

        $awalDT  = $tanggalAwal . ' 00:00:00';
        $akhirDT = $tanggalAkhir . ' 23:59:59';

        // ---------- 1. Total penjualan harian ----------
        $penjualanHarianRaw = (new Query())
            ->select([
                'tanggal' => 'DATE(t.created_at)',
                'total_transaksi' => 'COUNT(DISTINCT t.id)',
                'total_penjualan' => 'SUM(ti.subtotal)',
            ])
            ->from(['t' => 'transaction'])
            ->innerJoin(['ti' => 'transaction_item'], 'ti.transaction_id = t.id')
            ->where(['between', 't.created_at', $awalDT, $akhirDT])
            ->groupBy('DATE(t.created_at)')
            ->orderBy('tanggal ASC')
            ->all();
---
SELECT DATE(t.created_at) AS `tanggal`, COUNT(DISTINCT t.id) AS `total_transaksi`, SUM(ti.subtotal) AS `total_penjualan` FROM `transaction` `t` INNER JOIN `transaction_item` `ti` ON ti.transaction_id = t.id WHERE `t`.`created_at` BETWEEN '2026-08-04 00:00:00' AND '2026-08-26 23:59:59' GROUP BY DATE(t.created_at) ORDER BY `tanggal`

        }

        // ---------- 2. Barang terlaris ----------
        $barangTerlaris = (new Query())
            ->select([
                'product_id' => 'p.id',
                'nama_produk' => 'p.name',
                'total_qty' => 'SUM(ti.qty)',
                'total_pendapatan' => 'SUM(ti.subtotal)',
            ])
            ->from(['ti' => 'transaction_item'])
            ->innerJoin(['t' => 'transaction'], 't.id = ti.transaction_id')
            ->innerJoin(['p' => 'product'], 'p.id = ti.product_id')
            ->where(['between', 't.created_at', $awalDT, $akhirDT])
            ->groupBy(['p.id', 'p.name'])
            ->orderBy(['total_qty' => SORT_DESC])
            ->limit(10)
            ->all();
---
SELECT `p`.`id` AS `product_id`, `p`.`name` AS `nama_produk`, SUM(ti.qty) AS `total_qty`, SUM(ti.subtotal) AS `total_pendapatan` FROM `transaction_item` `ti` INNER JOIN `transaction` `t` ON t.id = ti.transaction_id INNER JOIN `product` `p` ON p.id = ti.product_id WHERE `t`.`created_at` BETWEEN '2026-09-19 00:00:00' AND '2026-09-25 23:59:59' GROUP BY `p`.`id`, `p`.`name` ORDER BY `total_qty` DESC LIMIT 10