controllers/CartController.php

SELECT * FROM `product` WHERE `id`='4'
---
    protected function findProduct($id)
    {
        $model = Product::findOne($id);

SELECT * FROM `product` WHERE `id`=4
---
    public function actionIndex()
    {
        $cart = $this->getCart();
        $items = [];
        $total = 0;

        foreach ($cart as $productId => $qty) {
            $product = Product::findOne($productId);