controllers/ProductController.php

    public function actionIndex()
    {
        $categoryId = Yii::$app->request->get('category_id');
        $search = Yii::$app->request->get('search');

        $query = Product::find();

        // filter kategori
        $query->andFilterWhere(['category_id' => $categoryId]);

        // search nama produk (LIKE)
        $query->andFilterWhere(['like', 'name', $search]);

        $dataProvider = new ActiveDataProvider([
            'query' => $query,
            'pagination' => [
                'pageSize' => 12,
            ],
            'sort' => [
                'defaultOrder' => ['name' => SORT_ASC],
            ],
        ]);

        $categories = Category::find()->all();
---
SELECT * FROM `category`