controllers/SiteController.php

    public function actionIndex()
    {
        // Guest tidak boleh akses beranda, lempar ke login
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }

        // Admin juga tidak pakai beranda customer ini
        if (Yii::$app->user->identity->role === 'admin') {
            return $this->redirect(['admin/product/index']);
        }

        $username = Yii::$app->user->identity->username;

        $topSale = Product::find()
            ->select(['product.*', 'SUM(transaction_item.qty) AS total_sold'])
            ->joinWith('transactionItems transaction_item', false)
            ->groupBy('product.id')
            ->orderBy(['total_sold' => SORT_DESC])
            ->limit(5)
            ->all();

        $recentProductIds = TransactionItem::find()
            ->select(['product_id', 'MAX(transaction.created_at) AS last_purchased'])
            ->joinWith('transaction', false)
            ->where(['transaction.user_name' => $username])
            ->groupBy('product_id')
            ->orderBy(['last_purchased' => SORT_DESC])
            ->limit(5)
            ->column();

        $recentProducts = Product::find()
            ->where(['id' => $recentProductIds])
            ->all();
---
SELECT `product`.*, SUM(transaction_item.qty) AS `total_sold` FROM `product` LEFT JOIN `transaction_item` `transaction_item` ON `product`.`id` = `transaction_item`.`product_id` GROUP BY `product`.`id` ORDER BY `total_sold` DESC LIMIT 5
SELECT `product_id`, MAX(transaction.created_at) AS `last_purchased` FROM `transaction_item` LEFT JOIN `transaction` ON `transaction_item`.`transaction_id` = `transaction`.`id` WHERE `transaction`.`user_name`='hanif' GROUP BY `product_id` ORDER BY `last_purchased` DESC LIMIT 5
SELECT * FROM `product` WHERE `id` IN (2, 3)