controllers/TransactionController.php

SELECT * FROM `product` WHERE `id`=4
---
    public function actionCheckout()
    {
        $cart = Yii::$app->session->get(CartController::SESSION_KEY, []);

        if (empty($cart)) {
            Yii::$app->session->setFlash('error', 'Keranjang Anda kosong.');
            return $this->redirect(['cart/index']);
        }

        $items = [];
        $total = 0;

        foreach ($cart as $productId => $qty) {
            $product = Product::findOne($productId);

INSERT INTO `transaction` (`user_name`, `code`, `total`, `paid_amount`, `change_amount`, `created_at`) VALUES ('hanif', 'TRX-20260925-95BC5D', '50000', '100000', '50000', '2026-09-25 00:49:13')
---
    private function processConfirm($items, $total, $bayar)
    {
        $db = Yii::$app->db;
        $dbTransaction = $db->beginTransaction();

        try {
            $kembalian = $bayar - $total;

            $transaction = new Transaction();
            $transaction->user_name     = Yii::$app->user->identity->username;
            $transaction->code          = $this->generateUniqueCode();
            $transaction->total         = $total;
            $transaction->paid_amount   = $bayar;
            $transaction->change_amount = $kembalian;
            $transaction->created_at    = date('Y-m-d H:i:s');

            if (!$transaction->save()) {

INSERT INTO `transaction_item` (`transaction_id`, `product_id`, `qty`, `price`, `subtotal`) VALUES (6, 4, 1, '50000.00', '50000')
---
                $transactionItem->price          = $product->price;
                $transactionItem->subtotal       = $item['subtotal'];

                if (!$transactionItem->save()) {

UPDATE `product` SET `stock`=4, `updated_at`=NOW() WHERE `id`=4
---
                }

                $product->stock -= $qty;
                if (!$product->save(false)) {

SELECT * FROM `transaction` WHERE (`id`='4') AND (`user_name`='hanif')
SELECT * FROM `transaction_item` WHERE `transaction_id`=4
---
    public function actionSuccess($id)
    {
        $transaction = Transaction::find()
            ->where(['id' => $id])
            ->andWhere(['user_name' => Yii::$app->user->identity->username])
            ->one();

        if (!$transaction) {
            throw new NotFoundHttpException('Transaksi tidak ditemukan.');
        }

        $items = TransactionItem::find()->where(['transaction_id' => $transaction->id])->all();