models/User.php

    public static function findIdentity($id): static|null
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`id`=2) AND (`status`=10)

    public static function findByUsername(string $username): static|null
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='admin') AND (`status`=10)